Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.todo.usage
source: Usage: cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Per-workspace checklist shown in the sidebar and todo pane. Targets the caller's workspace by default. Items are capped at 50 per workspace. Note for coding agents: this checklist belongs to the user. Do not add, edit, complete, remove, or replace items on your own initiative — only manage it when the user explicitly asks you to. Use your own internal task tracking for your plans. Subcommands: add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list Print items (1-based indexes) and progress check <index|id> Mark an item completed uncheck <index|id> Mark an item pending start <index|id> Mark an item in-progress edit <index|id> "text" Rewrite an item's text rm <index|id> Remove an item clear Remove every item set ['<json>'] Atomically replace the whole checklist from a JSON array of {text, state?, id?, origin?} objects (inline argument, or piped on stdin). Items whose id matches an existing item keep their identity and origin; the rest are created and unnamed existing items are removed. open Open (or focus) the workspace's todo pane <index> is the 1-based number printed by `cmux todo list`; <id> is the item UUID from `cmux todo list --json`. Examples: cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open See also: cmux workspace status
ar: الاستخدام: cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] تظهر قائمة مهام لكل مساحة عمل في الشريط الجانبي وجزء المهام (todo). تستهدف مساحة عمل المستدعي افتراضيًا. يقتصر عدد العناصر على 50 عنصرًا لكل مساحة عمل. ملاحظة لوكلاء البرمجة: هذه القائمة تخص المستخدم. لا تقم بإضافة، أو تعديل، أو إكمال، أو إزالة، أو استبدال العناصر بمبادرة منك — بل قم بإدارتها فقط عندما يطلب منك المستخدم ذلك صراحةً. استخدم تتبع المهام الداخلي الخاص بك لخططك. الأوامر الفرعية: add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list طباعة العناصر (الفهارس المستندة إلى 1) والتقدم المحرز check <index|id> وضع علامة اكتمال على عنصر uncheck <index|id> وضع علامة معلق على عنصر start <index|id> وضع علامة قيد التنفيذ على عنصر edit <index|id> "text" إعادة كتابة نص العنصر rm <index|id> إزالة عنصر clear إزالة كل العناصر set ['<json>'] استبدال قائمة المهام بالكامل بشكل ذري من مصفوفة JSON من كائنات {text, state?, id?, origin?} (كوسيطة مضمنة، أو عبر الأنبوب من stdin). تحتفظ العناصر التي يطابق معرفها عنصرًا موجودًا بهويتها ومصدرها؛ ويتم إنشاء الباقي وإزالة العناصر الحالية غير المسماة. open فتح (أو تركيز) جزء مهام مساحة العمل ‏<index> هو الرقم المستند إلى 1 والمطبوع بواسطة `cmux todo list`؛ و<id> هو معرف UUID الخاص بالعنصر من `cmux todo list --json`. أمثلة: cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open راجع أيضًا: cmux workspace status
de: Verwendung: cmux todo <Unterbefehl> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Checkliste pro Arbeitsbereich, die in der Seitenleiste und im Todo-Teilfenster angezeigt wird. Zielt standardmäßig auf den Arbeitsbereich des Aufrufers ab. Einträge sind auf 50 pro Arbeitsbereich begrenzt. Hinweis für Programmier-Agenten: Diese Checkliste gehört dem Benutzer. Fügen Sie nicht aus eigener Initiative Einträge hinzu, bearbeiten, schließen, entfernen oder ersetzen Sie sie nicht – verwalten Sie sie nur, wenn der Benutzer Sie ausdrücklich darum bittet. Verwenden Sie Ihre eigene interne Aufgabenverfolgung für Ihre Pläne. Unterbefehle: add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list Einträge (1-basierte Indizes) und Fortschritt ausgeben check <index|id> Einen Eintrag als abgeschlossen markieren uncheck <index|id> Einen Eintrag als ausstehend markieren start <index|id> Einen Eintrag als in Bearbeitung markieren edit <index|id> "text" Den Text eines Eintrags umschreiben rm <index|id> Einen Eintrag entfernen clear Alle Einträge entfernen set ['<json>'] Die gesamte Checkliste atomar durch ein JSON-Array von {text, state?, id?, origin?} Objekten ersetzen (Inline-Argument oder über stdin übergeben). Einträge, deren ID mit einem vorhandenen Eintrag übereinstimmt, behalten ihre Identität und Herkunft bei; der Rest wird erstellt und unbenannte vorhandene Einträge werden entfernt. open Öffnen (oder Fokussieren) des Todo-Teilfensters des Arbeitsbereichs <index> ist die von `cmux todo list` ausgegebene 1-basierte Nummer; <id> ist die Eintrags-UUID aus `cmux todo list --json`. Beispiele: cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open Siehe auch: cmux workspace status
es: Uso: cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Lista de tareas por espacio de trabajo que se muestra en la barra lateral y el panel de tareas pendientes. Se dirige al espacio de trabajo de quien lo solicita de forma predeterminada. Los elementos están limitados a 50 por espacio de trabajo. Nota para agentes de codificación: esta lista pertenece al usuario. No agregues, edites, completes, elimines ni reemplaces elementos por iniciativa propia; solo gestiónala cuando el usuario te lo solicite explícitamente. Usa tu propio seguimiento interno de tareas para tus planes. Subcomandos: add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list Muestra los elementos (índices basados en 1) y el progreso check <index|id> Marca un elemento como completado uncheck <index|id> Marca un elemento como pendiente start <index|id> Marca un elemento como en progreso edit <index|id> "text" Reescribe el texto de un elemento rm <index|id> Elimina un elemento clear Elimina todos los elementos set ['<json>'] Reemplaza de forma atómica toda la lista desde una matriz JSON de objetos {text, state?, id?, origin?} (argumento en línea o canalizado en stdin). Los elementos cuyo id coincide con un elemento existente conservan su identidad y origen; el resto se crea y los elementos existentes sin nombre se eliminan. open Abre (o enfoca) el panel de tareas pendientes del espacio de trabajo <index> es el número basado en 1 mostrado por `cmux todo list`; <id> es el UUID del elemento de `cmux todo list --json`. Ejemplos: cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open Véase también: cmux workspace status
fr: Utilisation : cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Liste des tâches par espace de travail affichée dans la barre latérale et le volet todo. Cible l' espace de travail de l'appelant par défaut. Les éléments sont limités à 50 par espace de travail. Note pour les agents de codage : cette liste de tâches appartient à l'utilisateur. N'ajoutez, ne modifiez, ne complétez, ne supprimez ni ne remplacez aucun élément de votre propre initiative — ne la gérez que si l'utilisateur vous le demande explicitement. Utilisez votre propre suivi des tâches interne pour vos plans. Sous-commandes : add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list Affiche les éléments (index à partir de 1) et la progression check <index|id> Marque un élément comme terminé uncheck <index|id> Marque un élément comme en attente start <index|id> Marque un élément comme en cours edit <index|id> "text" Réécrit le texte d'un élément rm <index|id> Supprime un élément clear Supprime tous les éléments set ['<json>'] Remplace de manière atomique toute la liste à partir d'un tableau JSON d'objets {text, state?, id?, origin?} (argument en ligne ou transmis via stdin). Les éléments dont l'id correspond à un élément existant conservent leur identité et leur origine ; les autres sont créés et les éléments existants non nommés sont supprimés. open Ouvre (ou met au premier plan) le volet todo de l'espace de travail <index> est le numéro à partir de 1 affiché par `cmux todo list` ; <id> est l' UUID de l'élément obtenu avec `cmux todo list --json`. Exemples : cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open Voir aussi : cmux workspace status
ja: 使用方法: cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] サイドバーおよび todo ペインに表示されるワークスペースごとのチェックリスト。デフォルトで 呼び出し元のワークスペースを対象とします。アイテムはワークスペースごとに最大 50 個までです。 コーディングエージェントへの注意: このチェックリストはユーザーのものです。自発的にアイテムの追加、 編集、完了、削除、置換を行わないでください。ユーザーから明示的な要求があった場合にのみ 管理してください。自身の計画には、独自に用意した内部的なタスク追跡を 使用してください。 サブコマンド: add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list アイテム（1から始まるインデックス）と進捗を出力 check <index|id> アイテムを完了としてマーク uncheck <index|id> アイテムを保留中（未完了）としてマーク start <index|id> アイテムを進行中としてマーク edit <index|id> "text" アイテムのテキストを書き換え rm <index|id> アイテムを削除 clear すべてのアイテムを削除 set ['<json>'] チェックリスト全体をアトミックに置換します。対象は {text, state?, id?, origin?} オブジェクトの JSON 配列 （インライン引数、または標準入力からパイプ）。 既存のアイテムと id が一致するアイテムは、 その識別子と作成元を保持します。その他は新規作成され、 名前のない既存のアイテムは削除されます。 open ワークスペースの todo ペインを開く（またはフォーカスする） <index> は `cmux todo list` によって出力される1から始まる番号です。<id> は `cmux todo list --json` から取得できるアイテムの UUID です。 例: cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open 関連項目: cmux workspace status
ko: 사용법: cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] 사이드바와 할 일 분할 창에 표시되는 작업 공간별 체크리스트입니다. 기본적으로 호출자의 작업 공간을 대상으로 합니다. 항목은 작업 공간당 최대 50개로 제한됩니다. 코딩 에이전트 참고 사항: 이 체크리스트는 사용자의 소유입니다. 스스로 항목을 추가, 수정, 완료, 삭제 또는 대체하지 마십시오. 오직 사용자가 명시적으로 요청한 경우에만 관리하십시오. 계획을 위해 자체 내부 작업 추적 기능을 사용하십시오. 하위 명령: add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list 항목(1부터 시작하는 인덱스) 및 진행 상황 출력 check <index|id> 항목을 완료로 표시 uncheck <index|id> 항목을 대기 상태로 표시 start <index|id> 항목을 진행 중으로 표시 edit <index|id> "text" 항목 텍스트 수정 rm <index|id> 항목 삭제 clear 모든 항목 삭제 set ['<json>'] {text, state?, id?, origin?} 객체의 JSON 배열로부터 체크리스트 전체를 원자적으로 교체 (인라인 인자 또는 표준 입력 파이프 사용). 기존 항목과 id가 일치하는 항목은 고유 식별자와 출처가 유지되며, 나머지는 새로 생성되고 지정되지 않은 기존 항목들은 삭제됩니다. open 작업 공간의 할 일 분할 창 열기(또는 포커스) <index>는 `cmux todo list`가 출력한 1부터 시작하는 번호이며, <id>는 `cmux todo list --json`에 나타나는 항목 UUID입니다. 예시: cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open 참고: cmux workspace status
zh_hans: 用法：cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] 在侧边栏和 todo 窗格中显示的每个工作区的核对清单。默认定位 调用者的工作区。每个工作区的项目上限为 50 个。 编码代理注意事项：此核对清单属于用户。请勿主动添加、 编辑、完成、移除或替换项目——仅在 用户明确要求时进行管理。请使用您自己的内部 任务跟踪来制定您的计划。 子命令： add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list 打印项目（从 1 开始的索引）和进度 check <index|id> 将项目标记为已完成 uncheck <index|id> 将项目标记为待办 start <index|id> 将项目标记为进行中 edit <index|id> "text" 重写项目的文本 rm <index|id> 移除项目 clear 移除所有项目 set ['<json>'] 原子性地替换整个核对清单，数据来自一个 {text, state?, id?, origin?} 的 JSON 数组 对象（内联参数，或由标准输入 stdin 管道传输）。 其 id 与现有项目匹配的项目将保留 其标识和来源；其余项目将被创建， 且未命名的现有项目将被移除。 open 打开（或聚焦）工作区的 todo 窗格 <index> 是 `cmux todo list` 打印的从 1 开始的编号；<id> 是 来自 `cmux todo list --json` 的项目 UUID。 示例： cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open 另请参阅：cmux workspace status
zh_hant: 用法：cmux todo <subcommand> [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] 顯示在側邊欄和待辦事項窗格中的各工作區檢查清單。預設目標為 呼叫者的工作區。每個工作區的項目上限為 50 個。 給 AI 代理的注意事項：此檢查清單屬於使用者。請勿主動 新增、編輯、完成、移除或取代項目 —— 只有在 使用者明確要求您時才進行管理。請使用您內部的 任務追蹤來規劃您的計畫。 子命令： add "text" [--state <pending|in-progress|completed>] [--origin <user|agent>] list 列印項目 (從 1 開始的索引) 與進度 check <index|id> 將項目標記為已完成 uncheck <index|id> 將項目標記為待處理 start <index|id> 將項目標記為進行中 edit <index|id> "text" 重寫項目的文字 rm <index|id> 移除一個項目 clear 移除所有項目 set ['<json>'] 從一個包含 {text, state?, id?, origin?} 物件的 JSON 陣列，不可分割地取代整個檢查清單 (內聯引數，或透過標準輸入 stdin 傳遞)。 其識別碼與現有項目相符的項目將保留 其身分與來源；其餘項目將會被建立， 且未命名的現有項目將會被移除。 open 開啟 (或聚焦) 工作區的待辦事項窗格 <index> 是由 `cmux todo list` 列印、從 1 開始的編號；<id> 是 來自 `cmux todo list --json` 的項目 UUID。 範例： cmux todo add "write regression test" cmux todo list cmux todo check 1 cmux todo start 2 --workspace workspace:3 my-plan-tool --json | cmux todo set cmux todo open 另請參閱：cmux workspace status

# cli.top.error.invalidWorkspace
source: top: invalid workspace handle '%@'
ar: top: معرّف مساحة العمل '%@' غير صالح
bs: top: neispravan identifikator radnog prostora '%@'
da: top: ugyldigt arbejdsområdehåndtag '%@'
de: top: ungültiger Workspace-Bezeichner '%@'
es: top: identificador de espacio de trabajo no válido '%@'
fr: top : identifiant d’espace de travail non valide '%@'
it: top: handle area di lavoro non valido '%@'
ja: top: ワークスペース指定 '%@' は無効です
ko: top: 잘못된 워크스페이스 핸들 '%@'
nb: top: ugyldig arbeidsområdehåndtak '%@'
pl: top: nieprawidłowy uchwyt obszaru roboczego '%@'
pt_br: top: identificador de workspace inválido '%@'
ru: top: недопустимый дескриптор рабочей области '%@'
th: top: แฮนเดิลเวิร์กสเปซไม่ถูกต้อง '%@'
tr: top: geçersiz çalışma alanı tanıtıcısı '%@'
uk: top: неприпустимий дескриптор робочої області '%@'
zh_hans: top：无效的工作区句柄 '%@'
zh_hant: top：無效的工作區控制代碼 '%@'

# cli.top.error.processDiagnosticsUnsupported
source: cmux top requires a running cmux build that supports process diagnostics
ar: يتطلب cmux top إصدار cmux قيد التشغيل يدعم تشخيص العمليات
bs: cmux top zahtijeva pokrenutu cmux verziju koja podržava dijagnostiku procesa
da: cmux top kræver en kørende cmux-build med procesdiagnostik
de: cmux top erfordert einen laufenden cmux-Build mit Prozessdiagnose
es: cmux top requiere una compilación de cmux en ejecución que admita diagnósticos de procesos
fr: cmux top nécessite une version cmux en cours d’exécution prenant en charge le diagnostic des processus
it: cmux top richiede una build cmux in esecuzione che supporti la diagnostica dei processi
ja: cmux top にはプロセス診断に対応した実行中の cmux ビルドが必要です
ko: cmux top에는 프로세스 진단을 지원하는 실행 중인 cmux 빌드가 필요합니다
nb: cmux top krever en kjørende cmux-build som støtter prosessdiagnostikk
pl: cmux top wymaga uruchomionej kompilacji cmux z obsługą diagnostyki procesów
pt_br: cmux top requer uma build cmux em execução com suporte a diagnósticos de processos
ru: cmux top требует запущенную сборку cmux с поддержкой диагностики процессов
th: cmux top ต้องใช้บิลด์ cmux ที่กำลังทำงานและรองรับการวินิจฉัยโปรเซส
tr: cmux top, süreç tanılamasını destekleyen çalışan bir cmux derlemesi gerektirir
uk: cmux top потребує запущеної збірки cmux із підтримкою діагностики процесів
zh_hans: cmux top 需要正在运行且支持进程诊断的 cmux 构建
zh_hant: cmux top 需要正在執行且支援行程診斷的 cmux 建置

# cli.uninstall.adminRequired
source: Administrator privileges were required to modify /usr/local/bin.
ar: كانت صلاحيات المسؤول مطلوبة لتعديل /usr/local/bin.
bs: Potrebne su administratorske privilegije za izmjenu /usr/local/bin.
da: Administratorrettigheder var nødvendige for at ændre /usr/local/bin.
de: Zum Ändern von /usr/local/bin waren Administratorrechte erforderlich.
es: Se requirieron privilegios de administrador para modificar /usr/local/bin.
fr: Des privilèges d'administrateur étaient nécessaires pour modifier /usr/local/bin.
it: Sono stati richiesti i privilegi di amministratore per modificare /usr/local/bin.
ja: /usr/local/binの変更に管理者権限が必要でした。
ko: /usr/local/bin을 수정하기 위해 관리자 권한이 필요합니다.
nb: Administratorrettigheter var nødvendig for å endre /usr/local/bin.
pl: Do modyfikacji /usr/local/bin wymagane były uprawnienia administratora.
pt_br: Privilégios de administrador foram necessários para modificar /usr/local/bin.
ru: Для изменения /usr/local/bin потребовались права администратора.
th: ต้องใช้สิทธิ์ผู้ดูแลระบบเพื่อแก้ไข /usr/local/bin
tr: /usr/local/bin dizinini değiştirmek için yönetici ayrıcalıkları gerekiyordu.
uk: Для зміни /usr/local/bin потрібні права адміністратора.
zh_hans: 修改 /usr/local/bin 需要管理员权限。
zh_hant: 修改 /usr/local/bin 需要管理者權限。

# cli.uninstall.notFound
source: No cmux CLI symlink was found at %@.
ar: لم يتم العثور على رابط رمزي لواجهة أوامر cmux في %@.
bs: Simbolička veza cmux CLI nije pronađena na %@.
da: Intet cmux CLI symbolsk link blev fundet på %@.
de: Es wurde keine symbolische Verknüpfung für cmux CLI unter %@ gefunden.
es: No se encontró ningún enlace simbólico de la CLI de cmux en %@.
fr: Aucun lien symbolique de la CLI cmux n'a été trouvé à l'emplacement %@.
it: Nessun collegamento simbolico della CLI di cmux trovato in %@.
ja: %@にcmux CLIのシンボリックリンクが見つかりませんでした。
ko: %@에서 cmux CLI 심볼릭 링크를 찾을 수 없습니다.
nb: Ingen cmux CLI-symbolsk lenke ble funnet på %@.
pl: Nie znaleziono dowiązania symbolicznego CLI cmux pod adresem %@.
pt_br: Nenhum link simbólico do CLI do cmux foi encontrado em %@.
ru: Символическая ссылка cmux CLI не найдена по пути %@.
th: ไม่พบลิงก์สัญลักษณ์ cmux CLI ที่ %@
tr: %@ konumunda cmux CLI sembolik bağı bulunamadı.
uk: Символічне посилання cmux CLI не знайдено за адресою %@.
zh_hans: 在 %@ 处未找到 cmux CLI 符号链接。
zh_hant: 在 %@ 找不到 cmux CLI 的符號連結。

# cli.uninstall.removed
source: Removed %@.
ar: تمت إزالة %@.
bs: Uklonjeno %@.
da: Fjernede %@.
de: %@ wurde entfernt.
es: Se eliminó %@.
fr: %@ a été supprimé.
it: Rimosso %@.
ja: %@を削除しました。
ko: %@을(를) 제거했습니다.
nb: Fjernet %@.
pl: Usunięto %@.
pt_br: %@ removido.
ru: Удалено: %@.
th: ลบ %@ แล้ว
tr: %@ kaldırıldı.
uk: Видалено %@.
zh_hans: 已移除 %@。
zh_hant: 已移除 %@。

# cli.uninstallFailed
source: Couldn't Uninstall cmux CLI
ar: تعذر إلغاء تثبيت واجهة أوامر cmux
bs: Nije moguće deinstalirati cmux CLI
da: Kunne ikke afinstallere cmux CLI
de: cmux CLI konnte nicht deinstalliert werden
es: No se pudo desinstalar la CLI de cmux
fr: Impossible de désinstaller la CLI cmux
it: Impossibile disinstallare la CLI di cmux
ja: cmux CLI をアンインストールできませんでした
ko: cmux CLI를 제거할 수 없습니다
nb: Kunne ikke avinstallere cmux CLI
pl: Nie udało się odinstalować CLI cmux
pt_br: Não Foi Possível Desinstalar o CLI do cmux
ru: Не удалось удалить cmux CLI
th: ไม่สามารถถอนการติดตั้ง cmux CLI ได้
tr: cmux CLI Kaldırılamadı
uk: Не вдалося видалити cmux CLI
zh_hans: 无法卸载 cmux CLI
zh_hant: 無法解除安裝 cmux CLI

# cli.uninstalled
source: cmux CLI Uninstalled
ar: تم إلغاء تثبيت واجهة أوامر cmux
bs: cmux CLI deinstaliran
da: cmux CLI afinstalleret
de: cmux CLI deinstalliert
es: CLI de cmux desinstalada
fr: CLI cmux désinstallée
it: CLI di cmux disinstallata
ja: cmux CLI がアンインストールされました
ko: cmux CLI 제거 완료
nb: cmux CLI avinstallert
pl: CLI cmux odinstalowane
pt_br: CLI do cmux Desinstalado
ru: cmux CLI удален
th: ถอนการติดตั้ง cmux CLI แล้ว
tr: cmux CLI Kaldırıldı
uk: cmux CLI видалено
zh_hans: cmux CLI 已卸载
zh_hant: cmux CLI 已解除安裝

# cli.vm.attach.cmuxTuiOnly
source: %1$@ attaches only through its cmux-tui daemon. Run `cmux vm tui %1$@`; if that reports no client, install one with `curl -fsSL https://cmux.com/tui/install-static.sh | sh` or point CMUX_TUI_CLIENT at a binary.
ar: يتصل %1$@ فقط من خلال خادم cmux-tui الخاص به. قم بتشغيل `cmux vm tui %1$@`؛ وإذا أبلغ ذلك عن عدم وجود عميل، فقم بتثبيت عميل باستخدام `curl -fsSL https://cmux.com/tui/install-static.sh | sh` أو قم بتوجيه CMUX_TUI_CLIENT إلى ملف ثنائي.
de: %1$@ verbindet sich nur über seinen cmux-tui-Daemon. Führen Sie `cmux vm tui %1$@` aus; wenn dies meldet, dass kein Client vorhanden ist, installieren Sie einen mit `curl -fsSL https://cmux.com/tui/install-static.sh | sh` oder verweisen Sie mit CMUX_TUI_CLIENT auf eine Binärdatei.
es: %1$@ se acopla solo a través de su demonio cmux-tui. Ejecuta `cmux vm tui %1$@`; si informa que no hay ningún cliente, instala uno con `curl -fsSL https://cmux.com/tui/install-static.sh | sh` o apunta CMUX_TUI_CLIENT a un binario.
fr: %1$@ se connecte uniquement via son démon cmux-tui. Exécutez `cmux vm tui %1$@` ; si cela indique qu'aucun client n'est présent, installez-en un avec `curl -fsSL https://cmux.com/tui/install-static.sh | sh` ou faites pointer CMUX_TUI_CLIENT vers un binaire.
ja: %1$@ は cmux-tui デーモン経由でのみ接続できます。`cmux vm tui %1$@` を実行してください。クライアントが見つからない場合は `curl -fsSL https://cmux.com/tui/install-static.sh | sh` でインストールするか、CMUX_TUI_CLIENT にバイナリを指定してください。
ko: %1$@ 은(는) cmux-tui 데몬을 통해서만 연결할 수 있습니다. `cmux vm tui %1$@`을(를) 실행하십시오. 클라이언트가 없다고 보고되는 경우, `curl -fsSL https://cmux.com/tui/install-static.sh | sh` 명령으로 설치하거나 CMUX_TUI_CLIENT 환경 변수가 바이너리를 가리키도록 설정하십시오.
zh_hans: %1$@ 只能通过其 cmux-tui 守护进程挂载。请运行 `cmux vm tui %1$@`；若提示没有客户端，用 `curl -fsSL https://cmux.com/tui/install-static.sh | sh` 安装一个，或把 CMUX_TUI_CLIENT 指向某个二进制文件。
zh_hant: %1$@ 僅透過其 cmux-tui 常駐程式進行連接。執行 `cmux vm tui %1$@`；如果回報沒有用戶端，請使用 `curl -fsSL https://cmux.com/tui/install-static.sh | sh` 安裝一個，或將 CMUX_TUI_CLIENT 指向執行檔。

# cli.vm.create.createdCloudVM
source: Created Cloud VM %@
ar: تم إنشاء Cloud VM %@
bs: Cloud VM %@ je kreiran
da: Oprettede Cloud VM %@
de: Cloud-VM %@ erstellt
es: Cloud VM %@ creada
fr: Cloud VM %@ créée
it: Cloud VM %@ creata
ja: Cloud VM %@ を作成しました
ko: Cloud VM %@ 생성됨
nb: Opprettet Cloud VM %@
pl: Utworzono Cloud VM %@
pt_br: Cloud VM %@ criada
ru: Cloud VM %@ создана
th: สร้าง Cloud VM %@ แล้ว
tr: Cloud VM %@ olusturuldu
uk: Cloud VM %@ створено
zh_hans: 已创建 Cloud VM %@
zh_hant: 已建立 Cloud VM %@

# cli.terminalCreation.error.commandRequiresValue
source: %@: --command requires <text>
ar: %@: يتطلب --command <text>
de: %@: --command erfordert <text>
es: %@: --command requiere <text>
fr: %@: --command nécessite <text>
ja: %@: --command には <text> が必要です
ko: %@: --command에는 <text>가 필요합니다
zh_hans: %@: --command 需要 <text>
zh_hant: %@: --command 需要 <text>

# cli.terminalCreation.error.commandRequiresTerminalType
source: %@: --command can only be used with --type terminal
ar: %@: لا يمكن استخدام --command إلا مع --type terminal
de: %@: --command kann nur mit --type terminal verwendet werden
es: %@: --command solo se puede usar con --type terminal
fr: %@: --command ne peut être utilisé qu’avec --type terminal
ja: %@: --command は --type terminal でのみ使用できます
ko: %@: --command는 --type terminal과 함께만 사용할 수 있습니다
zh_hans: %@: --command 只能与 --type terminal 搭配使用
zh_hant: %@: --command 只能與 --type terminal 搭配使用

# cli.terminalCreation.help.initialCommandDescription
source: Run this as the new terminal's initial command
ar: تشغيله كأمر أولي للطرفية الجديدة
de: Als Anfangsbefehl des neuen Terminals ausführen
es: Ejecutar como comando inicial del nuevo terminal
fr: Exécuter comme commande initiale du nouveau terminal
ja: 新しいターミナルの初期コマンドとして実行
ko: 새 터미널의 초기 명령으로 실행
zh_hans: 作为新终端的初始命令运行
zh_hant: 作為新終端機的初始指令執行

# cli.vm.create.machineReady
source: %@ is ready
ar: ‏%@ جاهز
de: %@ ist bereit
es: %@ está listo
fr: %@ est prête
ja: %@ の準備が完了しました
ko: %@이(가) 준비되었습니다
zh_hans: %@ 已就绪
zh_hant: %@ 已就緒

# cli.vm.desktop.unavailable
source: %@ has no desktop to show. New machines boot a screen; this one was created shell-only (`--base`).
ar: لا يحتوي %@ على سطح مكتب لعرضه. تبدأ الأجهزة الجديدة شاشة؛ ولكن تم إنشاء هذا الجهاز ليقتصر على الشل فقط (`--base`).
de: %@ hat keinen anzuzeigenden Desktop. Neue Maschinen starten einen Bildschirm; diese wurde rein für die Shell erstellt (`--base`).
es: %@ no tiene escritorio que mostrar. Las máquinas nuevas inician una pantalla; esta se creó solo para shell (`--base`).
fr: %@ n'a pas de bureau à afficher. Les nouvelles machines démarrent avec un écran ; celle-ci a été créée en mode shell uniquement (`--base`).
ja: %@ には表示できるデスクトップがありません。新しいマシンには画面がありますが、このマシンはシェル専用（`--base`）で作成されました。
ko: %@에 표시할 데스크톱이 없습니다. 새 가상 머신은 화면을 부팅하지만, 이 가상 머신은 셸 전용(`--base`)으로 생성되었습니다.
zh_hans: %@ 没有可显示的桌面。新机器会启动一个屏幕；这台是以仅 shell 方式创建的（`--base`）。
zh_hant: %@ 沒有可顯示的桌面。新機器會啟動螢幕；此機器建立時被設定為僅限 Shell (`--base`)。
